# ***********************************************************************************************
# Title   : 統計的因果推論の理論と実装
# Chapter : 3 統計的因果推論における重要な仮定
# Date    : 2022/06/06
# Page    : P31 - P44
# URL     : https://github.com/mtakahashi123/causality
# ***********************************************************************************************


# ＜概要＞
# - 無作為割り付けを行うことで統計的因果推論が可能になる理由をフォーマルに確認


# ＜目次＞
# 0 準備
# 1 データ概要
# 2 効果測定
# 3 回帰分析と共分散分析
# 4 プロット作成


# 0 準備 -------------------------------------------------------------------------------

# ライブラリ
library(tidyverse)
library(magrittr)


# データロード
data03 <- read_csv("csv/data03.csv")


# 1 データ概要 ---------------------------------------------------------------------------

# データ確認
data03 %>% print()

# サマリー
data03 %>% summary()


# 2 効果測定 ------------------------------------------------------------------------------

# 
# --- 処置群(1)と統制群(0)におけるy3の差分
# --- ナイーブな推定値(3.3)
y3t1_1 <- data03 %>% filter(t1 == 1) %>% pull(y3) %>% mean()
y3t1_0 <- data03 %>% filter(t1 == 0) %>% pull(y3) %>% mean()
y3t1_1 - y3t1_0


# 平均処置効果
# --- 
# --- 真値(9.8)
mean(data03$y1t) - mean(data03$y0t)


# 3 回帰分析と共分散分析 ----------------------------------------------------------------------

# ＜ポイント＞


# データ確認
data03 %>% select(y3, x1, t1)

# モデル構築
model <- lm(y3 ~ x1 + t1, data = data03)

# 回帰係数
# --- t1の回帰係数は9.81（平均処置効果の真値(9.8)を捉えている）
model %>% summary() %>% use_series(coefficient)

# 信頼区間
model %>% confint(level = 0.95)


# 4 プロット作成 -----------------------------------------------------------------------------

# ＜ポイント＞
# - 群のデータから回帰直線を導出してプロットする
# - 群ごとの回帰直線のシフト部分が平均処置効果を示す


# プロットの重ね書き
data03 %$% plot(x1[t1 == 0], y3[t1 == 0], xlim = c(60, 100), ylim = c(60, 100), pch = 4)
par(new = TRUE)
data03 %$% plot(x1[t1 == 1], y3[t1 == 1], xlim = c(60, 100), ylim = c(60, 100), pch = 2)

# 回帰直線の入力
# --- b2が平均処置効果の真値を捉えている
# --- b2が回帰直線をシフトさせている（平均処置効果）
b0 <- model %>% summary() %>% use_series(coefficients) %>% .[1, 1]
b1 <- model %>% summary() %>% use_series(coefficients) %>% .[2, 1]
b2 <- model %>% summary() %>% use_series(coefficients) %>% .[3, 1]
abline(a = b0, b = b1)
abline(a = b0 + b2, b = b1)
