# ***********************************************************************************************
# Title   : 統計的因果推論の理論と実装
# Chapter : 9 交互作用項のある共分散分析
# Date    : 2022/5/24
# Page    : P125 - P135
# URL     : https://github.com/mtakahashi123/causality
# ***********************************************************************************************


# ＜概要＞
# - 共分散分析は交絡変数を取り除く役割を持つ伝統的な手法で統計的因果推論において重要な手法
#   --- 交互作用項のある共分散分析を確認する
#   --- 共分散分析の限界についても確認する


# ＜目次＞
# 0 準備
# 1 共分散分析の仮定
# 2 交互作用項のある共分散分析
# 3 標準誤差の計算


# 0 準備 ---------------------------------------------------------------------

# ライブラリ
library(tidyverse)
library(magrittr)
library(broom)


# データロード
data09 <- read_csv("csv/data09.csv")


# 1 共分散分析の仮定 ----------------------------------------------------------------

# ＜ポイント＞
# - 共分散分析とはダミー変数を含む重回帰モデルとして表現される
#   --- 仮定1-6に加えて以下の仮定7を満たす必要がある

# ＜仮定7：回帰係数の平行性＞
# - 回帰係数の傾きβ1が潜在的結果変数のY0とY1の間で共通である
#   --- 満たされない場合に交互作用項のあるモデルを使う必要がある

# ＜データについて＞
# - 使用データのy0tとy1tは異なっているため仮定7を満たしていない
#   --- y0t = 0.6 * x1 + e1
#   --- y1t = 1.2 * x2 + e2


# データ確認
data09 %>% print()
data09 %>% summary()

# 平均処置効果(ATE)
mean(data09$y1t) - mean(data09$y0t)

# 共分散分析
# --- 交互作用項なし
model1 <- lm(y3 ~ x1 + t1, data = data09)

# 平均処置効果
# --- 回帰係数の傾きにより出力される
# --- 真値である108よりも過大に推定されている
model1 %>% summary() %>% use_series(coefficient)


# 2 交互作用項のある共分散分析 -----------------------------------------------------

# データ作成
# --- 交互作用項を追加
data09_2 <- data09 %>% mutate(x1t = data09$x1 * data09$t1)

# 共分散分析
# --- 交互作用項あり
model2 <- lm(y3 ~ x1 + t1 + x1t, data = data09_2)

# 平均処置効果
b2 <- model2 %>% summary() %>% use_series(coefficient) %>% .[3, 1]
b3 <- model2 %>% summary() %>% use_series(coefficient) %>% .[4, 1]
b2 + b3 * mean(data09_2$x1)


# 3 標準誤差の計算 ------------------------------------------------------------------

model2 %>% vcov()
v2 <- model2 %>% vcov() %>% diag() %>% .[3]
v3 <- model2 %>% vcov() %>% diag() %>% .[4]
x1bar <- data09$x1 %>% mean()
cov23 <- model2 %>% vcov() %>% .[3, 4]
vartau <- v2 + x1bar^2 * v3 + x1bar * 2 * cov23
setau <- vartau %>% sqrt()

# 簡便な分析方法
data09_2 <- data09 %>% mutate(x1t2= (data09$x1 - mean(data09$x1)) * (data09$t1 - mean(data09$t1)))
model3 <- lm(y3 ~ x1 + t1 + x1t2, data = data09)
model3 %>% summary() %>% use_series(coefficient)
