#***************************************************************************************
# Title     : 効果検証入門
# Chapter   : 学習目的
# Date      : 2021/2/8
# Page      : P1
# URL       : https://github.com/ghmagazine/cibook
#***************************************************************************************


# ＜スライド＞
# https://speakerdeck.com/housecat442


# ＜スライド＞
# 『効果検証入門から見直すデータサイエンス』
# 株式会社サイバーエージェント 安井 翔太氏（2020年8月28日webセミナー）
# https://www.youtube.com/watch?v=3u2NgamEhRc&t=1968s


# ＜書評＞
# 『効果検証入門』はマーケティング実験＆分析に関わる全ての人にお薦めの統計的因果推論の入門書
# https://tjo.hatenablog.com/entry/2020/01/24/190000


# ＜ブログ＞
# {CausalImpact}を使う上での注意点を簡単にまとめてみた
# https://tjo.hatenablog.com/entry/2019/09/10/080000
