#***************************************************************************************
# Title     : 効果検証入門
# Chapter   : 1章 セレクションバイアスとRCT
# Theme     : 1-5 ビジネスにおける因果推論の必要性
# Date      : 2022/06/21
# Page      : P33 - P37
# URL       : https://github.com/ghmagazine/cibook
#***************************************************************************************


# ＜問題提起＞
# - RCTが行われているデータにおいては単純な集計と検定で効果検証が可能
#   --- 効果検証のためにRCTの状態を作ることが実際に可能か？


# ＜RCTのコスト＞
# - ビジネス施策(クーポン配布など)は限られたマーケティング予算の中で行われる
#   --- 過去の購買履歴から売上最大化が期待できる人にクーポンを配布すべき
#   --- RCTでクーポンを配布することはビジネスチャンスを逃していることになる
#   --- 分析のためのビジネス施策は受け入れにくい


# ＜因果推論の視点＞
# - 理想的にはRCTでデータをデザインしたいが、現実的にそれができない場合にどうするか？
#   --- RCTに近似した状態を作り出したうえで効果検証を行う


# ＜セレクションバイアスの発生原因＞
# - 利得最大化のカギとなる要因で選別されることが多い
#   --- 発生原因はある程度は想定可能
