# ***********************************************************************************************
# Title   : 統計学OnePint5 欠測データ処理
# Chapter : 7 量的データの多重代入法1（平均値のt検定）
# Theme   : データ作成
# Date    : 2022/05/31
# Page    : P85 - P86
# URL     : https://www.kyoritsu-pub.co.jp/book/b10003896.html
# ***********************************************************************************************

# ライブラリ
library(magrittr)
library(readr)


# 系列作成
income <- c(244, 200, NA, 215, 432, 439, 346, 452, 526, NA, 486, NA,
            424, 507, NA, 571, NA, NA, 726, NA)

age <- c(22, 24, 30, 32, 34, 37, 38, 41, 42, 43, 44, 45, 46, 48, 49, 50, 51, 55, 57, 60)

# データ作成
df1 <- data.frame(income, age)

# データ保存
df1 %>% write_csv("csv/income_age.csv")
